src/Catalogs/СерийныеНомераEnLogic/СерийныеНомераEnLogic.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерийныеНомераEnLogic</name>
</mdclass:Catalog>

src/InformationRegisters/БарКоды/БарКоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БарКоды</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтарыйБарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>MAC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IMEI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодDanfoss</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерийныйНомерEnLogic</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IDКлюча</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>BT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.Перепрогон</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерИзделия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/СерийныеНомераEnLogic/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ЗагрузитьНаСервере(СерийныйНомерEnLogic,ПроверочныйКод)
Выбор = Справочники.СерийныеНомераEnLogic.НайтиПоКоду(СерийныйНомерEnLogic+ПроверочныйКод);
	Если Выбор.Пустая() Тогда
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БарКоды.БарКод
		|ИЗ
		|	РегистрСведений.БарКоды КАК БарКоды
		|ГДЕ
		|	БарКоды.СерийныйНомерEnLogic = &СерийныйНомерEnLogic";
	Запрос.УстановитьПараметр("СерийныйНомерEnLogic", СерийныйНомерEnLogic+ПроверочныйКод);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		Спр = Справочники.СерийныеНомераEnLogic.СоздатьЭлемент();
		Спр.Код = СерийныйНомерEnLogic+ПроверочныйКод; 
		Спр.Записать();	
		Иначе
	    Сообщить(СерийныйНомерEnLogic+"/"+ПроверочныйКод+" уже присвоен изделию!");
		КонецЕсли; 
	Иначе
	Сообщить(СерийныйНомерEnLogic+"/"+ПроверочныйКод+" уже загружен в базу!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
Текст = Новый ТекстовыйДокумент;
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);

Диалог.Заголовок = "Выберите файл с серийными номерами EnLogic";
Диалог.ПолноеИмяФайла = ""; 
Фильтр = "s/n EnLogic (*.csv)|*.csv"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;
	Если Диалог.Выбрать() Тогда
	Текст.Прочитать(Диалог.ПолноеИмяФайла);
		Для НомерСтроки = 2 По Текст.КоличествоСтрок() Цикл 
	    Стр = Текст.ПолучитьСтроку(НомерСтроки); 
	    Стр = Сред(Стр, Найти(Стр,";")+1); 
	    СерийныйНомерEnLogic = Лев(Стр,Найти(Стр,";")-1);
		СерийныйНомерEnLogic = СтрЗаменить(СерийныйНомерEnLogic,"-",""); 
		ПроверочныйКод = Сред(Стр, Найти(Стр,";")+1);
		ЗагрузитьНаСервере(СерийныйНомерEnLogic,ПроверочныйКод);
		КонецЦикла;
	Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры
